Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E35.tmx
Source language: en_us
Languages: zh_cn

source: Airport Sleeping Tips: How to Sleep in an Airport
zh_cn: 飞机场睡觉小贴士：在飞机场怎样入眠？

source: So you've come to realize this site is not a complete joke and people DO actually sleep in the airport to save money on hotels or just to make sure they don't sleep in and miss their flight.
zh_cn: 所以你开始意识到这个网站并不全是个笑话，人们真的会在飞机场过夜的，无论是为了省下住宾馆的钱或者是确保不睡过头而错过了他们的航班（这样的航班大多在半夜吧..XD..）。

source: You may now be curious about this odd idea of sleeping in airports and you may be asking yourself one (or all) of the following questions:
zh_cn: 你也许对睡在机场这个奇怪的主意感到好奇，你也许会提出下列问题：

source: Can I really sleep in an airport?
zh_cn: 我真的可以在飞机场过夜吗？

source: How do I do it?
zh_cn: 我该怎么做？

source: What should I bring with me?
zh_cn: 我该带些什么？

source: What tips do you have to share with us airport sleeping newbies?
zh_cn: 对于我们这些在机场过夜的菜鸟，你有什么样的建议？

source: Well, here are some ideas that will help you get started in your airport sleeping adventures.
zh_cn: 好吧，我有一些主意，能帮你开启你的机场夜宿之旅。

source: Tips
zh_cn: 贴士：

source: Always Have a Backup Plan: This is the most important tip for anyone who voluntarily sleeps in airports.
zh_cn: 1.随时准备一个备选方案：对于那些自愿在机场过夜的人来说，这条贴士是最重要的。

source: Some airport officials are not totally supportive of the airport sleeping idea.
zh_cn: 一些机场官员并不是特别支持在机场过夜。

source: Although you won't be kicked out of a large majority of the airports listed on this site, you will be asked why you are there, why you are not in a hotel like a normal person and they will ask for proof that you are flying out the next day.
zh_cn: 尽管此网站列出的多数机场不会把你列入黑名单，你却会被问到你为啥待在这，你为啥不像个正常人待在旅馆，然后他们会要求你提供你明天起飞的证明。

source: So BE PREPARED to answer those questions and present your outbound airline ticket! They seem to not appreciate us using these massive wastes of space as our personal hotels -- go figure!?!?
zh_cn: 所以准备好回答这些问题，并且向他们展示你的国际机票！—他们似乎不理解我们使用这些大量浪费的空间作我们个人的酒店 - 猜猜看？！

source: "Thankfully (and thanks to this site), we were fully prepared to sleep at the airport with our blankies and pillows."
zh_cn: “令人感激的是（同时感谢这个网站），我们充分准备好了在飞机场带着我们的枕头和毯子入睡。”

source: -Janet
zh_cn: ——珍妮特

source: 2.Expect your flight to be cancelled and be prepared: When reports of an upcoming snowstorm, hurricane (or erupting Icelandic volcano) are in the news a few days before your trip, you really have no excuse but to go to the airport prepared for a longer than expected airport stay.
zh_cn: 2.预料到你航班被取消的可能并且做好准备：如果有新闻报道在你旅行的几天前说未来几天有雪暴、飓风（或者冰岛的火山爆发），你真的没有任何借口，只能去机场准备一个比预期更长的逗留。

source: A cheap inflatable pool raftor travel mattress (they fold up nicely and make the hard floor a lot more comfortable).
zh_cn: 带上便宜的充气筏或旅行床垫（他们可以很好地折叠起来并且会让硬邦邦的地板变得更舒服）。

source: Keep in mind that in some airports sleeping on the floor is a no-no.
zh_cn: 要注意的是有些机场是不允许睡在地板上的。

source: Eye shades and ear plugs for obvious reasons.
zh_cn: 你有很明显的理由要带上眼罩和耳塞。

source: In a few airports, they do not permit laying down or closing your eyes (seriously!?!?) so a few airport sleepers have reported that they slept sitting up in a chair wearing a pair of sunglasses.
zh_cn: 一些机场需要带上墨镜，他们（工作人员）不允许你躺下或者闭上眼睛（真的吗？），所以一些机场睡客反应说他们坐在一个椅子上戴着一副墨镜睡觉。

source: I'm sure no one is fooled, but they are also handy to have when you don't have the eyeshades and you need to block out the light.
zh_cn: 我敢肯定没人会（对上面那个说法）上当，但它们（墨镜或眼罩）是方便的，如果你没有眼罩你只好选择（用手）阻挡光线。

source: Bottled water and snacks.
zh_cn: 带上瓶装水和小点心。

source: Many dining facilities and shops close down at night, so be sure to bring or buy food before the airport shuts down.
zh_cn: 很多餐饮设施和商店会在夜晚关闭，所以一定要在机场关闭前带上或者购买食物。

source: I try to mention if there are 24 hour food concessions in each airport's guide.
zh_cn: 我会尝试留意每个机场有没有24小时连锁食品经营店的说明。

source: Books/magazines/diary
zh_cn: 带上书/杂志/日记本

source: Personal music device with large headphones.
zh_cn: 带上一个巨大的耳机和个人音乐播放器。

source: Place it under your coat/in your pants....
zh_cn: 当你播放它时把它垫在你外套下或者放进你裤兜里。

source: There have been cases of people waking up with just their headphones, so be sure you don't make it easy for someone to walk off with it.
zh_cn: 有些案例里人们睡着后醒来时就只有耳机还在了，所以你要确定不会让别人轻易顺走你的播放器。

source: Headphones that cover your ears will help block out loud announcements.
zh_cn: 盖住你整个耳朵的大耳机会帮你隔绝外界噪音。

source: An alarm clock or a pen and post-it pad.
zh_cn: 带上闹钟或者笔和便笺本。

source: If you are travelling solo, write a "Wake me at 5:00 AM" note and stick a few on yourself and the seats around you -- it works.
zh_cn: 如果你是独自旅行，写下内容为“五点钟叫醒我”的便条，然后贴一些在自己身上和自己四周的座位上——它真的有用。

source: People will wake you.
zh_cn: 其他路人会叫醒你。

source: An airline blanket and/or pillow (borrowed - NOT STOLEN!!!) or bring your ownsleeping bag.
zh_cn: 带上航空毛毯和枕头（或者向机场方借）或者你自己的睡袋。

source: For unexpected overnight stays (bad weather, cancelled flights), did you know that some airports actually have cots and blankets for passenger use?
zh_cn: 为了难以预料的通宵逗留（坏天气，航班取消），你知道有些机场真的为旅客提供帆布床和毛毯的吗？

source: Ask and you may receive.
zh_cn: 你要问工作人员，或许就能拿到。

source: Disinfectant wipes.
zh_cn: 带上消毒湿巾。

source: Cleanliness is a problem in some airports, so these handy wipes will make your "bed" for the night a little less germ and grease covered.
zh_cn: 清洁在有些机场可能是个问题，所以这些湿巾会让你的“床”在晚上少一些细菌和油脂。

source: Tissue/toilet paper.
zh_cn: 带上面巾纸/厕所纸。

source: In some third world airport bathrooms, you will be forced to pay for two single ply sheets of toilet paper.
zh_cn: 在一些第三世界的飞机场厕所里，你会为两片厕纸而被强制要求付款。

source: Tipping money if you forgot to pack aforementioned toilet paper.
zh_cn: 带上零钱——如果你忘记带上一条。

source: Vick's Vapour rub.
zh_cn: 带上维克斯蒸气搓。

source: Place a dab of this under your nose to block out bad terminal odours.
zh_cn: 在你的鼻子下面轻轻拍上些这个用来阻挡航空站里的异味。

source: It works for people who work in morgues, so it should work in the airport.
zh_cn: 这东西对那些在停尸房工作的人有用，所以他肯定能对飞机场有用。

source: Power bar - energy supplies are short in some airports.
zh_cn: 带上电源/充电器——在某些机场，能源供应短缺。

source: You will make friends for life if you bring a multi-outlet power bar to recharge cell phones, laptops and ipods.
zh_cn: 你能够遇上相交一生的朋友如果你带了一个多功能电源插座为他们的手机、笔记本和ipod充电。

source: Instead of waiting for the other person to finish recharging, whip out the power bar and offer to share the outlet.
zh_cn: 与其排队等另一个人充完电，不如抛下电源然后共享（你自己带的）电插座。

source: Now, the challenge will be finding a live outlet that works.
zh_cn: 现在，难题变成了电源是否能接通。

source: Airports have made quite the effort deactivating a lot of outlets.
zh_cn: （很多）机场在电源网点上下了很大功夫。

source: Your camera to document your stay.
zh_cn: 带上你的相机来记录你的过夜。

source: Entertain yourselves.
zh_cn: 自己找些乐子吧。

source: More and more airports are providing WiFi (either free or for a fee).
zh_cn: 越来越多的机场开始提供WIFI（无论是免费的或者付费的）。

source: Bring your laptop and your favourite DVDs.
zh_cn: 带上你的笔记本和你最爱的DVD。

source: If these are unavailable to you, luggage cart and airport wheelchair races have also brightened a few faces around here.
zh_cn: 如果你没有这些，行李车和机场轮椅也会为这附近带些新面孔回来。

source: Try to behave though, you don't want to make it difficult for the next airport sleeper to stay in the terminal without problems.
zh_cn: 尝试做到上述贴士，如果你想使新的机场睡客在航空站逗留的时候毫无问题。

source: Be Safe: Whether you are sleeping in the airport by yourself or with friends, it is good to know where security is.
zh_cn: 3.保持安全。当你一个人或者和你的朋友在机场过夜时，知道保安在哪里是件好事。

source: Know where their office is and look for video cameras in the spot you decide to stay the night.
zh_cn: 知道他们的办公室在哪，并且通过寻找摄像头来决定你过夜的地方。

source: They've probably seen many airport sleepers before you and they will direct you to a safe spot.
zh_cn: 他们会看见许多在你之前的机场睡客，他们会引导你哪里安全。

source: If you are travelling alone I recommend that you sleep near other travellers.
zh_cn: 如果你是独自旅行，我建议你睡的离这些睡客们近些。

source: While there have never been any reports of attacks against airport sleepers, there have been a few bum fondlings.
zh_cn: 如果没有任何报道显示有人攻击机场睡客，那么那里就只有很少的流浪汉疯子。

source: A few ipods and laptops have also gone missing!
zh_cn: 有些ipod和手提电脑也可能会丢失！

source: Be smart and be safe!
zh_cn: 放聪明点，保持安全。

source: 4.Bring something comfortable to sit on:
zh_cn: 4.带一些坐下去舒服的东西：

source: If you have read any of the entries on this site, you'll probably have read about those pesky chairs with the arm handles or curved seats.
zh_cn: 如果你曾阅读过这个网站的一些页面，你可能会读到那些有着臂手柄的弧形的让人讨厌的椅子。

source: These seats are uncomfortable and could probably cause permanant lumbar damage if sat in for too long.
zh_cn: 这些椅子不仅不舒服而且可能对你的腰椎造成永久性损害，如果你坐的时间太长的话。

source: Get there early: If you are staying at a busy airport overnight, you'll have to get there early if you want a good spot, especially during the summer season (peak airport sleeping season).
zh_cn: 5.早点到那儿。如果你在一个繁忙的机场度过一整夜，如果你想拿到一个好去处，你就必须早点到那，尤其是在夏季（机场过夜高峰）。

source: Many people complain of limited seating when they arrive at 10PM.
zh_cn: 许多人在晚上十点的时候抵达都抱怨座位有限。

source: "Thanks for this homepage we found the nice comfortable bench at the restaurant where we spent the night." -kmaja
zh_cn: “感谢这个主页，让我们在餐厅里找到个美好又舒适的长椅度过了一晚。”——kmaja

source: Scope it out: finding a good spot may be your biggest challenge.
zh_cn: 6.筛选逗留范围：找个好地方也许是（机场过夜中）最大的一个挑战。

source: If the situation looks dismal, explore the airport and various terminals.
zh_cn: 如果那的环境有些惨淡，就去搜索一下整个机场或者其他的航站楼。

source: Take the terminal shuttles and go terminal hopping.
zh_cn: 乘坐航站楼来回巴士/地铁，能在航站楼之间转换。

source: Even if you are flying out of terminal A, you may discover that terminal C has better accommodation.
zh_cn: 就算你是在航站楼A起飞，你或许会发现航站楼C的住宿条件更好。

source: In airports where there is an international and a national terminal, you may discover that the national terminal closes down at night.
zh_cn: 在有国内航站楼和国际航站楼的飞机场里，你会发现国内航站楼半夜是会关闭的。

source: Don't panic, head over to the international terminal as it may remain open.
zh_cn: 不要慌张，往国际航站楼去吧，它也许仍会通宵开放。

source: Consider seating, temperature, announcements and people traffic when finding the best place to spend the night.
zh_cn: 在寻找最佳过夜地点的时候，要考虑座位，温度，机场通知和人员（其他旅客的）走动。

source: You may need to be creative such as sleeping behind ticket counters, under and behind seats, in wheelchairs and on luggage conveyor belts.
zh_cn: 你可以很有创意的，比如睡在售票柜台后面，睡在椅子后面或者下面，睡在行李传送带的轮椅上。

source: Your best source of info will be security, airport and airline staff.
zh_cn: 你最佳的信息来源来自于保安，机场方面和航空公司员工。

source: If you are nice, these people will likely direct you to a nice spot!
zh_cn: 如果你友好，这些人很可能直接为你指明一个好去处。

source: Just Park It!
zh_cn: 7.睡着停车场里！

source: - If you are travelling on a budget and do not want to pay for a room at one of the airport hotels, head over to the car rentals hall to find out the cost of a car rental and (assuming you can keep the car in the lot at no cost) sleep in the car.
zh_cn: 如果你的旅行有个预算，你又不想为其中一个机场宾馆的房间而破费，那就往汽车租赁服务大厅去吧，然后查到租一辆车的花费并且睡在车里（假设你可以保持汽车在很多情况下不花钱）。

source: The great part about this is that you can recline on padded seats and there will be no annoying security announcements or rattling luggage carts whipping past your head throughout the night.
zh_cn: 这个主意最妙的一点是你可以卧躺在软垫座椅上，然后没有了扰人整夜的安保通知，和咔嗒咔嗒一直在鞭打你的脑子的行李推车声。

source: On the negative side, car horns and screeching tires may jolt you from your slumber.
zh_cn: 不好的是，汽车喇叭声和刺耳的轮胎声可能会从浅眠中震醒你。

source: Protect Your Bags: If you can't keep your bags in the left luggage office overnight (check the airport guides on the site to see if your airport has one), you'll need to come up with a way to make sure someone can't access your bags.
zh_cn: 8.保护你的包。如果你不能把你的包留在行李寄存处过夜（查询这个网站的飞机场指南看看你的飞机场是不是有过夜行李寄存处），你必须想个法子以确保别人不会顺走你的包。

source: How you do this really depends on where and how you sleep, so there is no right answer.
zh_cn: 你怎么处理这问题主要取决于你在哪以及怎样睡觉，所以这个问题是没有正确解答的。

source: In my experience, I have always slept with zippers facing either myself, the ground or the wall.
zh_cn: 以我的经验来看，睡觉的时候，我总是带着拉链包，要么让它对着我自己，要么对着地，要么对着墙。

source: This makes gaining access more difficult and potentially noisy.
zh_cn: 这使得要别人靠近我的包更加困难或者必须要发出声音。

source: There have been times when I have slept with my arm or leg over or on top of the large bag, so that if it moves, I will wake.
zh_cn: 有几次我睡的时候用胳膊或腿圈住或者放在了大包的上面，所以当它被挪动的时候，我就会醒来。

source: Some people have chained their bag to their leg.
zh_cn: 有些人将他们的包和自己的腿锁在一起。

source: "I have to thank everyone who has provided reviews because it certainly helped me make a well researched decision" -mc60
zh_cn: “我必须感谢那些提供评论的人，因为它的确帮我做了一个明智的决定。”——mc60

source: Act Innocent: Even if you sleep in airports on regular basis -- Do Not Act Like A Professional!!!
zh_cn: 9.扮天真：尽管你按着以上常规睡在了飞机场——你也不要显得像个专业人士！

source: Act like you REALLY do not want to be there and that there is absolutely nowhere else to go.
zh_cn: 你要装成你真的很不想待在这但是的确也没别的地方可去了。

source: I find crying helps.
zh_cn: 我发现哭泣会有用的。

source: Remember, in the airport officials' eyes "the airport is not a motel."
zh_cn: 别忘了，在机场官员的眼里认为——“机场可不是汽车旅馆”。

source: Late Night Snack, anyone?
zh_cn: 10.有没有人要吃宵夜？

source: As many food concessions shut down at night around the time of the last flight, you'll want to stock up on supplies (water and late night snacks) before everything closes.
zh_cn: 鉴于很多食品零售商在夜里，在最后一班航班起飞的时间左右就会关闭，你会想要在一切关门前储存粮食的（水和夜宵）。

source: If you are travelling in a group, send out the most desperate looking person to wander aimlessly around the food court area when staff are starting to shut down.
zh_cn: 如果你是组团游，当那些员工们开始关门的时候，派一个你们里面看上去长得最惨的人去美食广场区瞎晃悠。

source: they may come back with some burgers and fries.
zh_cn: 他们走回来的时候也许会带着汉堡和薯条。

source: It's sometimes better to arrive than depart: The Arrivals lounges are sometimes more comfortable than the Ticket Counter area.
zh_cn: 11.有时候留在到达区比出发区更好。到达休息区有时候比柜台售票区要更舒适一些。

source: Dress for the occasion: Dress in layers.
zh_cn: 12.注意按场合着装：把自己套个层层叠叠最好。

source: "Thanks to a tip from the sleepinginairports website I found the reclining padded wheelchairs and slept in one of them."
zh_cn: “感谢‘睡在航空口岸’网站的一个贴士，我发现了一张斜倚软垫轮椅然后睡在了上面。”

source: Single Travellers Listen Up: Remember that in the airports where few, if any, other people camp out, you will have to take your luggage with you wherever you go.
zh_cn: 13.单人旅行者要注意了：记住在飞机场，如果有别的人也扎根过夜，你必须要让你的行李一直跟着你。

source: Even though you don't have to worry about people stealing your belongings, you can't just leave your stuff sitting there unattended.
zh_cn: 即使你不担心别人偷走你的行李，你也不能将你的东西放那待着不去理会。

source: If you do you may see the bomb squad taking apart your bag by the time you return from the washroom.
zh_cn: 如果你这么做了，当你从洗手间回来的时候你会看见炸弹小队拆掉了你的包。

source: Dealing with airport bribery: In some airports you will be asked for a bribe just to pass through a metal detector, enter an airport or to use the bathroom.
zh_cn: 14.处理机场敲诈：在一些机场，你会被要求给钱（贿赂/趁火打劫），只是为了通过金属探测器或者进入一个机场或者使用卫生间。

source: When approached by the unscrupulous individuals, suddenly speak a new language.
zh_cn: 当无良人士走近时，你要突然讲一门新的语言。

source: Learn Klingon if a real language doesn't interest you.
zh_cn: 如果你对一个真正的语言不感兴趣，那就学克林贡语。

source: Although you understand you are being asked for money, be bubbly and happy, but confused by your tormentor's actions.
zh_cn: 尽管你知道你在被敲诈，放轻松愉快些，但是要对那个敲诈者的行为表示疑惑。

source: When the offender holds out his/her hand for money, thank him, bow out of respect, shake his hand and smile.
zh_cn: 当那个罪犯伸手向你要钱，你要对他表示感谢，鞠躬来表示尊敬，挥手并且微笑。

source: Act incredibly dumb and show no fear, unless the individual has a gun or other weapon pointed at you.
zh_cn: 要扮的相当愚蠢和无惧，除非那货拿枪或者其他武器指着你了。

source: The object is to drag it out as long as you can until he hopefully gives up.
zh_cn: 计划是尽可能的拖延他的时间直到他希望放弃。

source: Unfortunately, this does not always work and it's better to just pay the damn "fee" - with lots of coin.
zh_cn: 不幸的是，这策略不一定有用，然后最好是付那些该死的“小费”——用一大把的硬币。

source: When sleep is Impossible: In Geneva (one of those airports with plastic, arm handle, bucket seat chairs) I could not sleep.
zh_cn: 15. 当睡着已经无望时：在日内瓦机场（那些塑料的带臂的桶型座椅机场之一）你无法入睡。

source: There was absolutely NOTHING to do and nobody around to talk to.
zh_cn: 那里绝对没有什么事可干也没有人可以聊天。

source: If I didn't have my journal, walkman (that's how long ago that stay was...the days of the "walkman") and book with me I would have died of boredom.
zh_cn: 如果我那时候没有随身带着带我的杂志，随身听（这是多久以前的事了......那些年是叫“随身听”）和书，我将会无聊致死了。

source: If you bring something to entertain yourself, the night will go faster.
zh_cn: 如果你带了一些可以娱乐的东西，那么夜晚会度过的比较快的。

source: See entertainment ideas listed at the end of item # 2.
zh_cn: 看有关娱乐的建议，在第二条最后那里。

source: "I called my friend earlier about missing my original flight and he said I should sleep here overnight, and he read me some of the reviews on sleepinginairports.net" -Tetsu
zh_cn: “我之前打电话告诉我朋友说我怀念我的正常航班行程，他说我应该待在那里过夜，然后他读了一些这个网站的评论给我听。”-Tetsu

source: Shhhhhhhhhh!!!!
zh_cn: 16.嘘！

source: Be considerate of your fellow airport sleepers!
zh_cn: 对与你的同行的机场睡客们体贴些。

source: Just because you can't sleep, that doesn't mean others shouldn't be able to as well.
zh_cn: 并不是你睡不着，其他人也都睡不着。

source: Take a hint when sleepers raise their heads off the floor and look directly at you with their death stares. You're too loud!
zh_cn: 当睡客们从地板上抬起头来直直地用死亡眼神凝视着你，那就是一个暗示了，你太吵了！
